Code/DataGeneration/openfoam/run/Channel_bend90/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        nFaces          90;
        startFace       122;
    }
    front
    {
        type            empty;
        nFaces          90;
        startFace       212;
    }
    bottom
    {
        type            patch;
        nFaces          4;
        startFace       302;
    }
    outer_arc
    {
        type            wall;
        nFaces          12;
        startFace       306;
    }
    right
    {
        type            patch;
        nFaces          4;
        startFace       318;
    }
    inner_arc
    {
        type            wall;
        nFaces          6;
        startFace       322;
    }
)

// ************************************************************************* //
