Code/DataGeneration/openfoam/run/Channel_bend90/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    bottom
    {
    	type         uniformFixedValue;
    	uniformValue
    	{
        	type            scale;
		scale		squarePulse;
		start		0.3;	
        	duration	0.3;
        	value        	(0 0.7 0);
    	}
    }

    outer_arc
    {
        type            noSlip;
    }
    

    right
    {
        type            zeroGradient;
    }
    
    inner_arc
    {
        type            noSlip;
    }
}

// ************************************************************************* //
