Code/DataGeneration/openfoam/run/Channel_bend90/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    bottom
    {
        type            zeroGradient;
    }


    outer_arc
    {
        type		zeroGradient;
    }

    right
    {
        type         uniformFixedValue;
    	uniformValue
    	{
        	type            scale;
		scale		squarePulse;
		start		0.3;	
        	duration	0.3;
        	value        	15.1;
    	}
    }
    
    inner_arc
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
